{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay2\NLSY97WageDifferentialsV1\logfiles\RespondentsMatchedToCollege.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Jan 2022, 12:24:00
{txt}
{com}. 
. *open NLSY97 Geocode education data 
. import delimited "C:\Users\jcoger\Documents\Essay2\NLSY97WageDifferentialsV1\rawdata\Education_R18.csv", case(upper) encoding(Big5)
{res}{text}(613 vars, 8,984 obs)

{com}.  
. *1998* 
. rename R2707700 GEO69_01_1998   // GEO69.01
{res}{txt}
{com}. rename R2707800 GEO69_02_1998   // GEO69.02
{res}{txt}
{com}. rename R2707900 GEO69_03_1998   // GEO69.03
{res}{txt}
{com}. rename R2708000 GEO69_04_1998   // GEO69.04
{res}{txt}
{com}. rename R2708100 GEO69_05_1998   // GEO69.05
{res}{txt}
{com}.   
. *1999*
. rename R3934100 GEO69_01_1999   // GEO69.01
{res}{txt}
{com}. rename R3934200 GEO69_02_1999   // GEO69.02
{res}{txt}
{com}. rename R3934300 GEO69_03_1999   // GEO69.03
{res}{txt}
{com}. rename R3934400 GEO69_04_1999   // GEO69.04
{res}{txt}
{com}. rename R3934500 GEO69_05_1999   // GEO69.05
{res}{txt}
{com}. 
. *2000*
. rename R5528100 GEO69_01_2000   // GEO69.01
{res}{txt}
{com}. rename R5528200 GEO69_02_2000   // GEO69.02
{res}{txt}
{com}. rename R5528300 GEO69_03_2000   // GEO69.03
{res}{txt}
{com}. rename R5528400 GEO69_04_2000   // GEO69.04
{res}{txt}
{com}. 
. *2001*
. rename R7289900 GEO69_01_2001   // GEO69.01
{res}{txt}
{com}. rename R7290000 GEO69_02_2001   // GEO69.02
{res}{txt}
{com}. rename R7290100 GEO69_03_2001   // GEO69.03
{res}{txt}
{com}. rename R7290200 GEO69_04_2001   // GEO69.04
{res}{txt}
{com}. rename R7290300 GEO69_05_2001   // GEO69.05
{res}{txt}
{com}. rename R7290301 GEO69_06_2001   // GEO69.06
{res}{txt}
{com}. 
. *2002*
. rename S1609800 GEO69_01_2002   // GEO69.01
{res}{txt}
{com}. rename S1609900 GEO69_02_2002   // GEO69.02
{res}{txt}
{com}. rename S1610000 GEO69_03_2002   // GEO69.03
{res}{txt}
{com}. rename S1610100 GEO69_04_2002   // GEO69.04
{res}{txt}
{com}. 
. *2003*
. rename S3595200 GEO69_01_2003   // GEO69.01
{res}{txt}
{com}. rename S3595300 GEO69_02_2003   // GEO69.02
{res}{txt}
{com}. rename S3595400 GEO69_03_2003   // GEO69.03
{res}{txt}
{com}. rename S3595500 GEO69_04_2003   // GEO69.04
{res}{txt}
{com}. rename S3595600 GEO69_05_2003   // GEO69.05
{res}{txt}
{com}. 
. *2004*
. rename S3869200 GEO69_01_2004   // GEO69.01
{res}{txt}
{com}. rename S3869300 GEO69_02_2004   // GEO69.02
{res}{txt}
{com}. rename S3869400 GEO69_03_2004   // GEO69.03
{res}{txt}
{com}. rename S3869500 GEO69_04_2004   // GEO69.04
{res}{txt}
{com}. rename S3869501 GEO69_05_2004   // GEO69.05
{res}{txt}
{com}. 
. *2005*
. rename S5452300 GEO69_01_2005   // GEO69.01
{res}{txt}
{com}. rename S5452400 GEO69_02_2005   // GEO69.02
{res}{txt}
{com}. rename S5452500 GEO69_03_2005   // GEO69.03
{res}{txt}
{com}. rename S5452600 GEO69_04_2005   // GEO69.04
{res}{txt}
{com}. 
. *2006*
. rename S7553800 GEO69_01_2006   // GEO69.01
{res}{txt}
{com}. rename S7553900 GEO69_02_2006   // GEO69.02
{res}{txt}
{com}. rename S7554000 GEO69_03_2006   // GEO69.03
{res}{txt}
{com}. rename S7554100 GEO69_04_2006   // GEO69.04
{res}{txt}
{com}. rename S7554200 GEO69_05_2006   // GEO69.05
{res}{txt}
{com}. 
. *2007*
. rename T0000700 GEO69_01_2007   // GEO69.01
{res}{txt}
{com}. rename T0000800 GEO69_02_2007   // GEO69.02
{res}{txt}
{com}. rename T0000900 GEO69_03_2007   // GEO69.03
{res}{txt}
{com}. rename T0001000 GEO69_04_2007   // GEO69.04
{res}{txt}
{com}. rename T0001100 GEO69_05_2007   // GEO69.05
{res}{txt}
{com}. 
. *2008*
. rename T2000600 GEO69_01_2008   // GEO69.01
{res}{txt}
{com}. rename T2000700 GEO69_02_2008   // GEO69.02
{res}{txt}
{com}. rename T2000800 GEO69_03_2008   // GEO69.03
{res}{txt}
{com}. rename T2000900 GEO69_04_2008   // GEO69.04
{res}{txt}
{com}. rename T2001000 GEO69_05_2008   // GEO69.05
{res}{txt}
{com}. rename T2001100 GEO69_06_2008   // GEO69.06
{res}{txt}
{com}. rename T2001200 GEO69_07_2008   // GEO69.07
{res}{txt}
{com}. rename T2001300 GEO69_08_2008   // GEO69.08
{res}{txt}
{com}. 
. *2009*
. rename T3622100 GEO69_01_2009   // GEO69.01
{res}{txt}
{com}. rename T3622200 GEO69_02_2009   // GEO69.02
{res}{txt}
{com}. rename T3622300 GEO69_03_2009   // GEO69.03
{res}{txt}
{com}. 
. *2010*
. rename T5222100 GEO69_01_2010   // GEO69.01
{res}{txt}
{com}. rename T5222200 GEO69_02_2010   // GEO69.02
{res}{txt}
{com}. rename T5222300 GEO69_03_2010   // GEO69.03
{res}{txt}
{com}. rename T5222400 GEO69_04_2010   // GEO69.04
{res}{txt}
{com}. rename T5222500 GEO69_05_2010   // GEO69.05
{res}{txt}
{com}. 
. *2011*
. rename T6674200 GEO69_01_2011   // GEO69.01
{res}{txt}
{com}. rename T6674300 GEO69_02_2011   // GEO69.02
{res}{txt}
{com}. rename T6674400 GEO69_03_2011   // GEO69.03
{res}{txt}
{com}. rename T6674500 GEO69_04_2011   // GEO69.04
{res}{txt}
{com}. 
. *2013*
. rename T8144700 GEO69_01_2013   // GEO69.01
{res}{txt}
{com}. rename T8144800 GEO69_02_2013   // GEO69.02
{res}{txt}
{com}. rename T8144900 GEO69_03_2013   // GEO69.03
{res}{txt}
{com}. rename T8145000 GEO69_04_2013   // GEO69.04
{res}{txt}
{com}. 
. *2015*
. rename U0026200 GEO69_01_2015   // GEO69.01
{res}{txt}
{com}. rename U0026300 GEO69_02_2015   // GEO69.02
{res}{txt}
{com}. rename U0026400 GEO69_03_2015   // GEO69.03
{res}{txt}
{com}. rename U0026500 GEO69_04_2015   // GEO69.04
{res}{txt}
{com}. 
. *2017*
. rename U1865000 GEO69_01_2017   // GEO69.01
{res}{txt}
{com}. rename U1865100 GEO69_02_2017   // GEO69.02
{res}{txt}
{com}. rename U1865200 GEO69_03_2017   // GEO69.03
{res}{txt}
{com}. rename U1865300 GEO69_04_2017   // GEO69.04
{res}{txt}
{com}. rename U1865400 GEO69_05_2017   // GEO69.05
{res}{txt}
{com}. rename U1865500 GEO69_06_2017   // GEO69.06
{res}{txt}
{com}. 
. 
. 
. keep R0000100 GEO69_01_1998 GEO69_02_1998 GEO69_03_1998 GEO69_04_1998 GEO69_05_1998 GEO69_01_1999 GEO69_02_1999 GEO69_03_1999 GEO69_04_1999 GEO69_05_1999 GEO69_01_2000 GEO69_02_2000 GEO69_03_2000 GEO69_04_2000  GEO69_01_2001 GEO69_02_2001 GEO69_03_2001 GEO69_04_2001 GEO69_05_2001 GEO69_06_2001 GEO69_01_2002 GEO69_02_2002 GEO69_03_2002  GEO69_04_2002 GEO69_01_2003 GEO69_02_2003 GEO69_03_2003 GEO69_04_2003 GEO69_05_2003 GEO69_01_2004 GEO69_02_2004 GEO69_03_2004 GEO69_04_2004  GEO69_05_2004 GEO69_01_2005 GEO69_02_2005 GEO69_03_2005 GEO69_04_2005 GEO69_01_2006 GEO69_02_2006 GEO69_03_2006 GEO69_04_2006 GEO69_05_2006 GEO69_01_2007 GEO69_02_2007 GEO69_03_2007 GEO69_04_2007 GEO69_05_2007 GEO69_01_2008 GEO69_02_2008 GEO69_03_2008 GEO69_04_2008 GEO69_05_2008 GEO69_06_2008 GEO69_07_2008 GEO69_08_2008 GEO69_01_2009 GEO69_02_2009 GEO69_03_2009 GEO69_01_2010 GEO69_02_2010 GEO69_03_2010 GEO69_04_2010 GEO69_05_2010 GEO69_01_2011 GEO69_02_2011 GEO69_03_2011 GEO69_04_2011 GEO69_01_2013 GEO69_02_2013 GEO69_03_2013 GEO69_04_2013 GEO69_01_2015 GEO69_02_2015 GEO69_03_2015 GEO69_04_2015  GEO69_01_2017 GEO69_02_2017 GEO69_03_2017 GEO69_04_2017 GEO69_05_2017 GEO69_06_2017  
{txt}
{com}. 
. *merge datasets to add data on degree majors and types
. merge 1:1 R0000100 using "C:\Users\jcoger\Documents\Essay2\NLSY97WageDifferentialsV1\rawdata\Essay2MatchingColleges.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           8,984{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. *Define the directory
. global PATH "C:\Users\jcoger\Documents\Essay2\NLSY97WageDifferentialsV1\dofiles_dtafiles"
{txt}
{com}. cd $PATH
{res}C:\Users\jcoger\Documents\Essay2\NLSY97WageDifferentialsV1\dofiles_dtafiles
{txt}
{com}. 
. rename B0008900 PSTRAN_DGR_CCMCODE_01_01_01_PSTR   // PSTRAN_DGR_CCMCODE.01.01.01
{res}{txt}
{com}. rename B0009000 PSTRAN_DGR_CCMCODE_01_01_02_PSTR   // PSTRAN_DGR_CCMCODE.01.01.02
{res}{txt}
{com}. rename B0009100 PSTRAN_DGR_CCMCODE_01_02_01_PSTR   // PSTRAN_DGR_CCMCODE.01.02.01
{res}{txt}
{com}. rename B0009200 PSTRAN_DGR_CCMCODE_01_03_01_PSTR   // PSTRAN_DGR_CCMCODE.01.03.01
{res}{txt}
{com}. rename B0009300 PSTRAN_DGR_CCMCODE_01_04_01_PSTR   // PSTRAN_DGR_CCMCODE.01.04.01
{res}{txt}
{com}. rename B0009400 PSTRAN_DGR_CCMCODE_01_05_01_PSTR   // PSTRAN_DGR_CCMCODE.01.05.01
{res}{txt}
{com}. rename B0009500 PSTRAN_DGR_CCMCODE_02_01_01_PSTR   // PSTRAN_DGR_CCMCODE.02.01.01
{res}{txt}
{com}. rename B0009600 PSTRAN_DGR_CCMCODE_02_01_02_PSTR   // PSTRAN_DGR_CCMCODE.02.01.02
{res}{txt}
{com}. rename B0009700 PSTRAN_DGR_CCMCODE_02_02_01_PSTR   // PSTRAN_DGR_CCMCODE.02.02.01
{res}{txt}
{com}. rename B0009800 PSTRAN_DGR_CCMCODE_02_03_01_PSTR   // PSTRAN_DGR_CCMCODE.02.03.01
{res}{txt}
{com}. rename B0009900 PSTRAN_DGR_CCMCODE_02_04_01_PSTR   // PSTRAN_DGR_CCMCODE.02.04.01
{res}{txt}
{com}. rename B0010000 PSTRAN_DGR_CCMCODE_03_01_01_PSTR   // PSTRAN_DGR_CCMCODE.03.01.01
{res}{txt}
{com}. rename B0010100 PSTRAN_DGR_CCMCODE_03_01_02_PSTR   // PSTRAN_DGR_CCMCODE.03.01.02
{res}{txt}
{com}. rename B0010200 PSTRAN_DGR_CCMCODE_03_02_01_PSTR   // PSTRAN_DGR_CCMCODE.03.02.01
{res}{txt}
{com}. rename B0010300 PSTRAN_DGR_CCMCODE_03_03_01_PSTR   // PSTRAN_DGR_CCMCODE.03.03.01
{res}{txt}
{com}. rename B0010400 PSTRAN_DGR_CCMCODE_04_01_01_PSTR   // PSTRAN_DGR_CCMCODE.04.01.01
{res}{txt}
{com}. rename B0010500 PSTRAN_DGR_CCMCODE_04_01_02_PSTR   // PSTRAN_DGR_CCMCODE.04.01.02
{res}{txt}
{com}. rename B0010600 PSTRAN_DGR_CCMCODE_04_02_01_PSTR   // PSTRAN_DGR_CCMCODE.04.02.01
{res}{txt}
{com}. rename B0010700 PSTRAN_DGR_CCMCODE_04_03_01_PSTR   // PSTRAN_DGR_CCMCODE.04.03.01
{res}{txt}
{com}. rename B0010800 PSTRAN_DGR_CCMCODE_05_01_01_PSTR   // PSTRAN_DGR_CCMCODE.05.01.01
{res}{txt}
{com}. rename B0010900 PSTRAN_DGR_CCMCODE_06_01_01_PSTR   // PSTRAN_DGR_CCMCODE.06.01.01
{res}{txt}
{com}. rename B0011000 PSTRAN_DGR_CCMCODE_07_01_01_PSTR   // PSTRAN_DGR_CCMCODE.07.01.01
{res}{txt}
{com}. rename B0011100 PSTRAN_DGR_CCMCODE_07_02_01_PSTR   // PSTRAN_DGR_CCMCODE.07.02.01
{res}{txt}
{com}. rename B0011200 PSTRAN_DGR_CCMSOURCE_01_01_01   // PSTRAN_DGR_CCMSOURCE.01.01.01
{res}{txt}
{com}. rename B0011300 PSTRAN_DGR_CCMSOURCE_01_01_02   // PSTRAN_DGR_CCMSOURCE.01.01.02
{res}{txt}
{com}. rename B0011400 PSTRAN_DGR_CCMSOURCE_01_02_01   // PSTRAN_DGR_CCMSOURCE.01.02.01
{res}{txt}
{com}. rename B0011500 PSTRAN_DGR_CCMSOURCE_01_03_01   // PSTRAN_DGR_CCMSOURCE.01.03.01
{res}{txt}
{com}. rename B0011600 PSTRAN_DGR_CCMSOURCE_01_04_01   // PSTRAN_DGR_CCMSOURCE.01.04.01
{res}{txt}
{com}. rename B0011700 PSTRAN_DGR_CCMSOURCE_01_05_01   // PSTRAN_DGR_CCMSOURCE.01.05.01
{res}{txt}
{com}. rename B0011800 PSTRAN_DGR_CCMSOURCE_02_01_01   // PSTRAN_DGR_CCMSOURCE.02.01.01
{res}{txt}
{com}. rename B0011900 PSTRAN_DGR_CCMSOURCE_02_01_02   // PSTRAN_DGR_CCMSOURCE.02.01.02
{res}{txt}
{com}. rename B0012000 PSTRAN_DGR_CCMSOURCE_02_02_01   // PSTRAN_DGR_CCMSOURCE.02.02.01
{res}{txt}
{com}. rename B0012100 PSTRAN_DGR_CCMSOURCE_02_03_01   // PSTRAN_DGR_CCMSOURCE.02.03.01
{res}{txt}
{com}. rename B0012200 PSTRAN_DGR_CCMSOURCE_02_04_01   // PSTRAN_DGR_CCMSOURCE.02.04.01
{res}{txt}
{com}. rename B0012300 PSTRAN_DGR_CCMSOURCE_03_01_01   // PSTRAN_DGR_CCMSOURCE.03.01.01
{res}{txt}
{com}. rename B0012400 PSTRAN_DGR_CCMSOURCE_03_01_02   // PSTRAN_DGR_CCMSOURCE.03.01.02
{res}{txt}
{com}. rename B0012500 PSTRAN_DGR_CCMSOURCE_03_02_01   // PSTRAN_DGR_CCMSOURCE.03.02.01
{res}{txt}
{com}. rename B0012600 PSTRAN_DGR_CCMSOURCE_03_03_01   // PSTRAN_DGR_CCMSOURCE.03.03.01
{res}{txt}
{com}. rename B0012700 PSTRAN_DGR_CCMSOURCE_04_01_01   // PSTRAN_DGR_CCMSOURCE.04.01.01
{res}{txt}
{com}. rename B0012800 PSTRAN_DGR_CCMSOURCE_04_01_02   // PSTRAN_DGR_CCMSOURCE.04.01.02
{res}{txt}
{com}. rename B0012900 PSTRAN_DGR_CCMSOURCE_04_02_01   // PSTRAN_DGR_CCMSOURCE.04.02.01
{res}{txt}
{com}. rename B0013000 PSTRAN_DGR_CCMSOURCE_04_03_01   // PSTRAN_DGR_CCMSOURCE.04.03.01
{res}{txt}
{com}. rename B0013100 PSTRAN_DGR_CCMSOURCE_05_01_01   // PSTRAN_DGR_CCMSOURCE.05.01.01
{res}{txt}
{com}. rename B0013200 PSTRAN_DGR_CCMSOURCE_06_01_01   // PSTRAN_DGR_CCMSOURCE.06.01.01
{res}{txt}
{com}. rename B0013300 PSTRAN_DGR_CCMSOURCE_07_01_01   // PSTRAN_DGR_CCMSOURCE.07.01.01
{res}{txt}
{com}. rename B0013400 PSTRAN_DGR_CCMSOURCE_07_02_01   // PSTRAN_DGR_CCMSOURCE.07.02.01
{res}{txt}
{com}. rename B0017300 PSTRAN_DGR_TYPE_01_01_PSTR   // PSTRAN_DGR_TYPE.01.01
{res}{txt}
{com}. rename B0017400 PSTRAN_DGR_TYPE_01_02_PSTR   // PSTRAN_DGR_TYPE.01.02
{res}{txt}
{com}. rename B0017500 PSTRAN_DGR_TYPE_01_03_PSTR   // PSTRAN_DGR_TYPE.01.03
{res}{txt}
{com}. rename B0017600 PSTRAN_DGR_TYPE_01_04_PSTR   // PSTRAN_DGR_TYPE.01.04
{res}{txt}
{com}. rename B0017700 PSTRAN_DGR_TYPE_01_05_PSTR   // PSTRAN_DGR_TYPE.01.05
{res}{txt}
{com}. rename B0017800 PSTRAN_DGR_TYPE_02_01_PSTR   // PSTRAN_DGR_TYPE.02.01
{res}{txt}
{com}. rename B0017900 PSTRAN_DGR_TYPE_02_02_PSTR   // PSTRAN_DGR_TYPE.02.02
{res}{txt}
{com}. rename B0018000 PSTRAN_DGR_TYPE_02_03_PSTR   // PSTRAN_DGR_TYPE.02.03
{res}{txt}
{com}. rename B0018100 PSTRAN_DGR_TYPE_02_04_PSTR   // PSTRAN_DGR_TYPE.02.04
{res}{txt}
{com}. rename B0018200 PSTRAN_DGR_TYPE_02_05_PSTR   // PSTRAN_DGR_TYPE.02.05
{res}{txt}
{com}. rename B0018300 PSTRAN_DGR_TYPE_03_01_PSTR   // PSTRAN_DGR_TYPE.03.01
{res}{txt}
{com}. rename B0018400 PSTRAN_DGR_TYPE_03_02_PSTR   // PSTRAN_DGR_TYPE.03.02
{res}{txt}
{com}. rename B0018500 PSTRAN_DGR_TYPE_03_03_PSTR   // PSTRAN_DGR_TYPE.03.03
{res}{txt}
{com}. rename B0018600 PSTRAN_DGR_TYPE_04_01_PSTR   // PSTRAN_DGR_TYPE.04.01
{res}{txt}
{com}. rename B0018700 PSTRAN_DGR_TYPE_04_02_PSTR   // PSTRAN_DGR_TYPE.04.02
{res}{txt}
{com}. rename B0018800 PSTRAN_DGR_TYPE_04_03_PSTR   // PSTRAN_DGR_TYPE.04.03
{res}{txt}
{com}. rename B0018900 PSTRAN_DGR_TYPE_05_01_PSTR   // PSTRAN_DGR_TYPE.05.01
{res}{txt}
{com}. rename B0019000 PSTRAN_DGR_TYPE_06_01_PSTR   // PSTRAN_DGR_TYPE.06.01
{res}{txt}
{com}. rename B0019100 PSTRAN_DGR_TYPE_07_01_PSTR   // PSTRAN_DGR_TYPE.07.01
{res}{txt}
{com}. rename B0019200 PSTRAN_DGR_TYPE_07_02_PSTR   // PSTRAN_DGR_TYPE.07.02
{res}{txt}
{com}. rename R0000100 PUBID_1997 
{res}{txt}
{com}. rename R0536300 SEX_1997 
{res}{txt}
{com}. rename R0536401 BDATE_M_1997 
{res}{txt}
{com}. rename R0536402 BDATE_Y_1997 
{res}{txt}
{com}. rename R1235800 CV_SAMPLE_TYPE_1997 
{res}{txt}
{com}. rename R1482600 RACE_ETHNICITY_1997 
{res}{txt}
{com}. rename R1770300 YSCH_23450_01_1998   // YSCH-23450.01
{res}{txt}
{com}. rename R1770400 YSCH_23450_02_1998   // YSCH-23450.02
{res}{txt}
{com}. rename R1770500 YSCH_23450_03_1998   // YSCH-23450.03
{res}{txt}
{com}. rename R1770600 YSCH_23450_04_1998   // YSCH-23450.04
{res}{txt}
{com}. rename R3069900 YSCH_23450_01_1999   // YSCH-23450.01
{res}{txt}
{com}. rename R3070000 YSCH_23450_02_1999   // YSCH-23450.02
{res}{txt}
{com}. rename R3070100 YSCH_23450_03_1999   // YSCH-23450.03
{res}{txt}
{com}. rename R4355300 YSCH_23450_01_2000   // YSCH-23450.01
{res}{txt}
{com}. rename R4355400 YSCH_23450_02_2000   // YSCH-23450.02
{res}{txt}
{com}. rename R4355500 YSCH_23450_03_2000   // YSCH-23450.03
{res}{txt}
{com}. rename R6030500 YSCH_23450_01_2001   // YSCH-23450.01
{res}{txt}
{com}. rename R6030600 YSCH_23450_02_2001   // YSCH-23450.02
{res}{txt}
{com}. rename R6030700 YSCH_23450_03_2001   // YSCH-23450.03
{res}{txt}
{com}. rename R6030800 YSCH_23450_04_2001   // YSCH-23450.04
{res}{txt}
{com}. rename R6030900 YSCH_23450_05_2001   // YSCH-23450.05
{res}{txt}
{com}. rename R6031000 YSCH_23450_06_2001   // YSCH-23450.06
{res}{txt}
{com}. rename S0443300 YSCH_23450_01_2002   // YSCH-23450.01
{res}{txt}
{com}. rename S0443400 YSCH_23450_02_2002   // YSCH-23450.02
{res}{txt}
{com}. rename S0443500 YSCH_23450_03_2002   // YSCH-23450.03
{res}{txt}
{com}. rename S0443600 YSCH_23450_05_2002   // YSCH-23450.05
{res}{txt}
{com}. rename S2471900 YSCH_23450_01_2003   // YSCH-23450.01
{res}{txt}
{com}. rename S2472000 YSCH_23450_02_2003   // YSCH-23450.02
{res}{txt}
{com}. rename S2472100 YSCH_23450_03_2003   // YSCH-23450.03
{res}{txt}
{com}. rename S4213100 YSCH_23450_01_2004   // YSCH-23450.01
{res}{txt}
{com}. rename S4213200 YSCH_23450_02_2004   // YSCH-23450.02
{res}{txt}
{com}. rename S4213300 YSCH_23450_03_2004   // YSCH-23450.03
{res}{txt}
{com}. rename S5805500 YSCH_23450_01_2005   // YSCH-23450.01
{res}{txt}
{com}. rename S5805600 YSCH_23450_02_2005   // YSCH-23450.02
{res}{txt}
{com}. rename S5805700 YSCH_23450_03_2005   // YSCH-23450.03
{res}{txt}
{com}. rename S7894000 YSCH_23450_01_2006   // YSCH-23450.01
{res}{txt}
{com}. rename S7894100 YSCH_23450_02_2006   // YSCH-23450.02
{res}{txt}
{com}. rename S7894200 YSCH_23450_03_2006   // YSCH-23450.03
{res}{txt}
{com}. rename S7894300 YSCH_23450_04_2006   // YSCH-23450.04
{res}{txt}
{com}. rename S7894400 YSCH_23450_05_2006   // YSCH-23450.05
{res}{txt}
{com}. rename T0307500 YSCH_23450_01_2007   // YSCH-23450.01
{res}{txt}
{com}. rename T0307600 YSCH_23450_02_2007   // YSCH-23450.02
{res}{txt}
{com}. rename T0307700 YSCH_23450_03_2007   // YSCH-23450.03
{res}{txt}
{com}. rename T2323800 YSCH_23450_01_2008   // YSCH-23450.01
{res}{txt}
{com}. rename T2323900 YSCH_23450_02_2008   // YSCH-23450.02
{res}{txt}
{com}. rename T2324000 YSCH_23450_03_2008   // YSCH-23450.03
{res}{txt}
{com}. rename T3850300 YSCH_23450_01_2009   // YSCH-23450.01
{res}{txt}
{com}. rename T3850400 YSCH_23450_02_2009   // YSCH-23450.02
{res}{txt}
{com}. rename T3850500 YSCH_23450_03_2009   // YSCH-23450.03
{res}{txt}
{com}. rename T5474900 YSCH_23450_01_2010   // YSCH-23450.01
{res}{txt}
{com}. rename T5475000 YSCH_23450_02_2010   // YSCH-23450.02
{res}{txt}
{com}. rename T5475100 YSCH_23450_03_2010   // YSCH-23450.03
{res}{txt}
{com}. rename T6887400 YSCH_23450_01_2011   // YSCH-23450.01
{res}{txt}
{com}. rename T6887500 YSCH_23450_02_2011   // YSCH-23450.02
{res}{txt}
{com}. rename T8382300 YSCH_23450_01_2013   // YSCH-23450.01
{res}{txt}
{com}. rename T8382400 YSCH_23450_02_2013   // YSCH-23450.02
{res}{txt}
{com}. rename T8382500 YSCH_23450_03_2013   // YSCH-23450.03
{res}{txt}
{com}. rename U0248900 YSCH_23450_01_2015   // YSCH-23450.01
{res}{txt}
{com}. rename U0249000 YSCH_23450_02_2015   // YSCH-23450.02
{res}{txt}
{com}. rename U1846000 CV_HIGHEST_DEGREE_EVER_EDT_2017 
{res}{txt}
{com}. rename U2166200 YSCH_23450_01_2017   // YSCH-23450.01
{res}{txt}
{com}. rename U2166300 YSCH_23450_02_2017   // YSCH-23450.02
{res}{txt}
{com}. rename U2166400 YSCH_23450_03_2017   // YSCH-23450.03
{res}{txt}
{com}. rename U2166500 YSCH_23450_04_2017   // YSCH-23450.04
{res}{txt}
{com}. 
. *generate college variable
. generate college = 0
{txt}
{com}. 
. replace college = GEO69_01_1998 if YSCH_23450_01_1998 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_02_1998 if YSCH_23450_02_1998 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_03_1998 if YSCH_23450_03_1998 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_04_1998 if YSCH_23450_04_1998 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_1999 if YSCH_23450_01_1999 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_02_1999 if YSCH_23450_02_1999 == 3
{txt}(1 real change made)

{com}. replace college = GEO69_03_1999 if YSCH_23450_03_1999 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2000 if YSCH_23450_01_2000 == 3
{txt}(1 real change made)

{com}. replace college = GEO69_02_2000 if YSCH_23450_02_2000 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_03_2000 if YSCH_23450_03_2000 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2001 if YSCH_23450_01_2001 == 3
{txt}(10 real changes made)

{com}. replace college = GEO69_02_2001 if YSCH_23450_02_2001 == 3
{txt}(3 real changes made)

{com}. replace college = GEO69_03_2001 if YSCH_23450_03_2001 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_04_2001 if YSCH_23450_04_2001 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_05_2001 if YSCH_23450_05_2001 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_06_2001 if YSCH_23450_06_2001 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2002 if YSCH_23450_01_2002 == 3
{txt}(83 real changes made)

{com}. replace college = GEO69_02_2002 if YSCH_23450_02_2002 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_03_2002 if YSCH_23450_03_2002 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2003 if YSCH_23450_01_2003 == 3
{txt}(200 real changes made)

{com}. replace college = GEO69_02_2003 if YSCH_23450_02_2003 == 3
{txt}(3 real changes made)

{com}. replace college = GEO69_03_2003 if YSCH_23450_03_2003 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2004 if YSCH_23450_01_2004 == 3
{txt}(210 real changes made)

{com}. replace college = GEO69_02_2004 if YSCH_23450_02_2004 == 3
{txt}(4 real changes made)

{com}. replace college = GEO69_03_2004 if YSCH_23450_03_2004 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2005 if YSCH_23450_01_2005 == 3
{txt}(245 real changes made)

{com}. replace college = GEO69_02_2005 if YSCH_23450_02_2005 == 3
{txt}(4 real changes made)

{com}. replace college = GEO69_03_2005 if YSCH_23450_03_2005 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2006 if YSCH_23450_01_2006 == 3
{txt}(307 real changes made)

{com}. replace college = GEO69_02_2006 if YSCH_23450_02_2006 == 3
{txt}(8 real changes made)

{com}. replace college = GEO69_03_2006 if YSCH_23450_03_2006 == 3
{txt}(1 real change made)

{com}. replace college = GEO69_04_2006 if YSCH_23450_04_2006 == 3
{txt}(1 real change made)

{com}. replace college = GEO69_05_2006 if YSCH_23450_05_2006 == 3
{txt}(2 real changes made)

{com}. replace college = GEO69_01_2007 if YSCH_23450_01_2007 == 3
{txt}(217 real changes made)

{com}. replace college = GEO69_02_2007 if YSCH_23450_02_2007 == 3
{txt}(2 real changes made)

{com}. replace college = GEO69_03_2007 if YSCH_23450_03_2007 == 3
{txt}(1 real change made)

{com}. replace college = GEO69_01_2008 if YSCH_23450_01_2008 == 3
{txt}(116 real changes made)

{com}. replace college = GEO69_02_2008 if YSCH_23450_02_2008 == 3
{txt}(7 real changes made)

{com}. replace college = GEO69_03_2008 if YSCH_23450_03_2008 == 3
{txt}(1 real change made)

{com}. replace college = GEO69_01_2009 if YSCH_23450_01_2009 == 3
{txt}(74 real changes made)

{com}. replace college = GEO69_02_2009 if YSCH_23450_02_2009 == 3
{txt}(5 real changes made)

{com}. replace college = GEO69_03_2009 if YSCH_23450_03_2009 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2010 if YSCH_23450_01_2010 == 3
{txt}(59 real changes made)

{com}. replace college = GEO69_02_2010 if YSCH_23450_02_2010 == 3
{txt}(2 real changes made)

{com}. replace college = GEO69_03_2010 if YSCH_23450_03_2010 == 3
{txt}(2 real changes made)

{com}. replace college = GEO69_01_2011 if YSCH_23450_01_2011 == 3
{txt}(38 real changes made)

{com}. replace college = GEO69_02_2011 if YSCH_23450_02_2011 == 3
{txt}(0 real changes made)

{com}. replace college = GEO69_01_2013 if YSCH_23450_01_2013 == 3
{txt}(63 real changes made)

{com}. replace college = GEO69_02_2013 if YSCH_23450_02_2013 == 3
{txt}(11 real changes made)

{com}. replace college = GEO69_03_2013 if YSCH_23450_03_2013 == 3
{txt}(1 real change made)

{com}. replace college = GEO69_01_2015 if YSCH_23450_01_2015 == 3
{txt}(55 real changes made)

{com}. replace college = GEO69_02_2015 if YSCH_23450_02_2015 == 3
{txt}(8 real changes made)

{com}. replace college = GEO69_01_2017 if YSCH_23450_01_2017 == 3
{txt}(48 real changes made)

{com}. replace college = GEO69_02_2017 if YSCH_23450_02_2017 == 3
{txt}(6 real changes made)

{com}. replace college = GEO69_03_2017 if YSCH_23450_03_2017 == 3
{txt}(4 real changes made)

{com}. replace college = GEO69_04_2017 if YSCH_23450_04_2017 == 3
{txt}(1 real change made)

{com}. 
. *generate major1 and major2 variables
. generate major1 = 0
{txt}
{com}. 
. generate major2 = 0
{txt}
{com}. 
. *school 1, degree 1, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_01_01_01_PSTR if PSTRAN_DGR_TYPE_01_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_01_01_01 == 1
{txt}(776 real changes made)

{com}. 
. *school 1, degree 1, major 2
. replace major2 = PSTRAN_DGR_CCMCODE_01_01_02_PSTR if PSTRAN_DGR_TYPE_01_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_01_01_02 == 2
{txt}(118 real changes made)

{com}. 
. *school 1, degree 2, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_01_02_01_PSTR if PSTRAN_DGR_TYPE_01_02_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_01_02_01 == 1
{txt}(34 real changes made)

{com}. 
. *school 1, degree 3, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_01_03_01_PSTR if PSTRAN_DGR_TYPE_01_03_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_01_03_01 == 1
{txt}(3 real changes made)

{com}. 
. *school 1, degree 4, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_01_04_01_PSTR if PSTRAN_DGR_TYPE_01_04_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_01_04_01 == 1 
{txt}(0 real changes made)

{com}. 
. *school 1, degree 5, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_01_05_01_PSTR if PSTRAN_DGR_TYPE_01_05_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_01_05_01 == 1
{txt}(0 real changes made)

{com}. 
. *school 2, degree 1, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_02_01_01_PSTR if PSTRAN_DGR_TYPE_02_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_02_01_01 == 1
{txt}(274 real changes made)

{com}. 
. *school 2, degree 1, major 2
. replace major2 = PSTRAN_DGR_CCMCODE_02_01_02_PSTR if PSTRAN_DGR_TYPE_02_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_02_01_02 == 2
{txt}(29 real changes made)

{com}. 
. *school 2, degree 2, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_02_02_01_PSTR if PSTRAN_DGR_TYPE_02_02_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_02_02_01 == 1
{txt}(7 real changes made)

{com}. 
. *school 2, degree 3, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_02_03_01_PSTR if PSTRAN_DGR_TYPE_02_03_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_02_03_01 == 1
{txt}(0 real changes made)

{com}. 
. *school 2, degree 4, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_02_04_01_PSTR if PSTRAN_DGR_TYPE_02_04_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_02_04_01 == 1
{txt}(0 real changes made)

{com}. 
. *school 3, degree 1, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_03_01_01_PSTR if PSTRAN_DGR_TYPE_03_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_03_01_01 == 1
{txt}(61 real changes made)

{com}. 
. *school 3, degree 1, major 2
. replace major2 = PSTRAN_DGR_CCMCODE_03_01_02_PSTR if PSTRAN_DGR_TYPE_03_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_03_01_02 == 2
{txt}(3 real changes made)

{com}. 
. *school 3, degree 2, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_03_02_01_PSTR if PSTRAN_DGR_TYPE_03_02_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_03_02_01 == 1
{txt}(1 real change made)

{com}. 
. *school 3, degree 3, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_03_03_01_PSTR if PSTRAN_DGR_TYPE_03_03_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_03_03_01 == 1
{txt}(0 real changes made)

{com}. 
. *school 4, degree 1, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_04_01_01_PSTR if PSTRAN_DGR_TYPE_04_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_04_01_01 == 1
{txt}(12 real changes made)

{com}. 
. *school 4, degree 1, major 2
. replace major2 = PSTRAN_DGR_CCMCODE_04_01_02_PSTR if PSTRAN_DGR_TYPE_04_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_04_01_02 == 2
{txt}(0 real changes made)

{com}. 
. *school 4, degree 2, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_04_02_01_PSTR if PSTRAN_DGR_TYPE_04_02_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_04_02_01 == 1
{txt}(0 real changes made)

{com}. 
. *school 4, degree 3, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_04_03_01_PSTR if PSTRAN_DGR_TYPE_04_03_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_04_03_01 == 1
{txt}(0 real changes made)

{com}. 
. *school 5, degree 1, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_05_01_01_PSTR if PSTRAN_DGR_TYPE_05_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_05_01_01 == 1
{txt}(6 real changes made)

{com}. 
. *school 6, degree 1, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_06_01_01_PSTR if PSTRAN_DGR_TYPE_06_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_06_01_01 == 1
{txt}(0 real changes made)

{com}. 
. *school 7, degree 1, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_07_01_01_PSTR if PSTRAN_DGR_TYPE_07_01_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_07_01_01 == 1
{txt}(0 real changes made)

{com}. 
. *school 7, degree 2, major 1
. replace major1 = PSTRAN_DGR_CCMCODE_07_02_01_PSTR if PSTRAN_DGR_TYPE_07_02_PSTR == 3 & PSTRAN_DGR_CCMSOURCE_07_02_01 == 1
{txt}(1 real change made)

{com}. 
. *rename respondents identification number to id
. rename PUBID_1997 id
{res}{txt}
{com}. 
. *drop all extra variables
. keep id college major1 major2 
{txt}
{com}. 
. *drop if there is no data for college
. keep if college > 0
{txt}(7,219 observations deleted)

{com}. 
. save "RespondentsMatchedToCollege.dta"
{txt}file RespondentsMatchedToCollege.dta saved

{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay2\NLSY97WageDifferentialsV1\logfiles\RespondentsMatchedToCollege.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}28 Jan 2022, 12:24:01
{txt}{.-}
{smcl}
{txt}{sf}{ul off}